{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "macaron",
    "1": "beignet",
    "10": "knish",
    "100": "sloppy_joe",
    "101": "gingerbread",
    "102": "crab_cake",
    "103": "sauerbraten",
    "104": "peking_duck",
    "105": "guacamole",
    "106": "ham_sandwich",
    "107": "crumpet",
    "108": "taco",
    "109": "strawberry_shortcake",
    "11": "croquette",
    "110": "clam_chowder",
    "111": "cottage_pie",
    "112": "croque_madame",
    "113": "french_onion_soup",
    "114": "beef_carpaccio",
    "115": "torte",
    "116": "poi",
    "117": "crab_food",
    "118": "bacon_and_eggs",
    "119": "coffee_cake",
    "12": "couscous",
    "120": "custard",
    "121": "syllabub",
    "122": "pork_chop",
    "123": "fried_rice",
    "124": "boiled_egg",
    "125": "galantine",
    "126": "brisket",
    "127": "reuben",
    "128": "schnitzel",
    "129": "ambrosia_food",
    "13": "porridge",
    "130": "gyoza",
    "131": "jerky",
    "132": "ravioli",
    "133": "fried_calamari",
    "134": "spaghetti_carbonara",
    "135": "miso_soup",
    "136": "frozen_yogurt",
    "137": "wonton",
    "138": "panna_cotta",
    "139": "french_toast",
    "14": "stuffed_cabbage",
    "140": "enchilada",
    "141": "ceviche",
    "142": "fettuccine",
    "143": "chili",
    "144": "flan",
    "145": "kabob",
    "146": "sponge_cake",
    "147": "casserole",
    "148": "paella",
    "149": "blancmange",
    "15": "seaweed_salad",
    "150": "bruschetta",
    "151": "tortellini",
    "152": "grilled_salmon",
    "153": "french_fries",
    "154": "shrimp_and_grits",
    "155": "churro",
    "156": "donut",
    "157": "meat_loaf_food",
    "158": "meatball",
    "159": "scrapple",
    "16": "chow_mein",
    "160": "strudel",
    "161": "coconut_cake",
    "162": "marble_cake",
    "163": "filet_mignon",
    "164": "hamburger",
    "165": "fried_egg",
    "166": "tuna_tartare",
    "167": "penne",
    "168": "eggs_benedict",
    "169": "bread_pudding",
    "17": "rigatoni",
    "170": "takoyaki",
    "171": "tenderloin",
    "172": "chocolate_mousse",
    "173": "baked_alaska",
    "174": "hot_dog",
    "175": "confit",
    "176": "ham_and_eggs",
    "177": "biryani",
    "178": "greek_salad",
    "179": "huevos_rancheros",
    "18": "beef_tartare",
    "180": "tagliatelle",
    "181": "stuffed_peppers",
    "182": "cannelloni",
    "183": "pizza",
    "184": "sausage_roll",
    "185": "chicken_quesadilla",
    "186": "hot_and_sour_soup",
    "187": "prime_rib",
    "188": "cheesecake",
    "189": "limpet_food",
    "19": "cannoli",
    "190": "ziti",
    "191": "mussel",
    "192": "manicotti",
    "193": "ice_cream",
    "194": "waffle",
    "195": "oyster",
    "196": "omelette",
    "197": "clam_food",
    "198": "burrito",
    "199": "roulade",
    "2": "cruller",
    "20": "foie_gras",
    "200": "lobster_bisque",
    "201": "grilled_cheese_sandwich",
    "202": "gyro",
    "203": "pound_cake",
    "204": "pho",
    "205": "lobster_roll_sandwich",
    "206": "baby_back_rib",
    "207": "tapenade",
    "208": "pepper_steak",
    "209": "welsh_rarebit",
    "21": "cupcake",
    "210": "pilaf",
    "211": "dolmas",
    "212": "coquilles_saint_jacques",
    "213": "veal_cordon_bleu",
    "214": "shirred_egg",
    "215": "barbecued_wing",
    "216": "lobster_thermidor",
    "217": "steak_au_poivre",
    "218": "huitre",
    "219": "chiffon_cake",
    "22": "osso_buco",
    "220": "profiterole",
    "221": "toad_in_the_hole",
    "222": "chicken_marengo",
    "223": "victoria_sandwich",
    "224": "tamale_pie",
    "225": "boston_cream_pie",
    "226": "fish_stick",
    "227": "crumb_cake",
    "228": "chicken_provencale",
    "229": "vol_au_vent",
    "23": "pad_thai",
    "230": "entrecote",
    "231": "carbonnade_flamande",
    "232": "bacon_lettuce_tomato_sandwich",
    "233": "scotch_egg",
    "234": "pirogi",
    "235": "peach_melba",
    "236": "upside_down_cake",
    "237": "applesauce_cake",
    "238": "rugulah",
    "239": "rock_cake",
    "24": "poutine",
    "240": "barbecued_spareribs",
    "241": "beef_bourguignonne",
    "242": "rissole",
    "243": "mostaccioli",
    "244": "apple_turnover",
    "245": "matzo_ball",
    "246": "chicken_cordon_bleu",
    "247": "eccles_cake",
    "248": "moo_goo_gai_pan",
    "249": "buffalo_wing",
    "25": "ramen",
    "250": "stuffed_tomato",
    "26": "pulled_pork_sandwich",
    "27": "bibimbap",
    "28": "chicken_kiev",
    "29": "apple_pie",
    "3": "cockle_food",
    "30": "risotto",
    "31": "fruitcake",
    "32": "chop_suey",
    "33": "haggis",
    "34": "scrambled_eggs",
    "35": "frittata",
    "36": "scampi",
    "37": "sushi",
    "38": "orzo",
    "39": "fritter",
    "4": "samosa",
    "40": "nacho",
    "41": "beef_stroganoff",
    "42": "beef_wellington",
    "43": "spring_roll",
    "44": "savarin",
    "45": "crayfish_food",
    "46": "souffle",
    "47": "adobo",
    "48": "streusel",
    "49": "deviled_egg",
    "5": "tiramisu",
    "50": "escargot",
    "51": "club_sandwich",
    "52": "carrot_cake",
    "53": "falafel",
    "54": "farfalle",
    "55": "terrine",
    "56": "poached_egg",
    "57": "gnocchi",
    "58": "bubble_and_squeak",
    "59": "egg_roll",
    "6": "tostada",
    "60": "caprese_salad",
    "61": "sauerkraut",
    "62": "creme_brulee",
    "63": "pavlova",
    "64": "fondue",
    "65": "scallop",
    "66": "jambalaya",
    "67": "tempura",
    "68": "chocolate_cake",
    "69": "potpie",
    "7": "moussaka",
    "70": "spaghetti_bolognese",
    "71": "sukiyaki",
    "72": "applesauce",
    "73": "baklava",
    "74": "salisbury_steak",
    "75": "linguine",
    "76": "edamame",
    "77": "coq_au_vin",
    "78": "tamale",
    "79": "macaroni_and_cheese",
    "8": "dumpling",
    "80": "kedgeree",
    "81": "garlic_bread",
    "82": "beet_salad",
    "83": "steak_tartare",
    "84": "vermicelli",
    "85": "pate",
    "86": "pancake",
    "87": "tetrazzini",
    "88": "onion_rings",
    "89": "red_velvet_cake",
    "9": "sashimi",
    "90": "compote",
    "91": "lobster_food",
    "92": "chicken_curry",
    "93": "chicken_wing",
    "94": "caesar_salad",
    "95": "succotash",
    "96": "hummus",
    "97": "fish_and_chips",
    "98": "lasagna",
    "99": "lutefisk"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "adobo": 47,
    "ambrosia_food": 129,
    "apple_pie": 29,
    "apple_turnover": 244,
    "applesauce": 72,
    "applesauce_cake": 237,
    "baby_back_rib": 206,
    "bacon_and_eggs": 118,
    "bacon_lettuce_tomato_sandwich": 232,
    "baked_alaska": 173,
    "baklava": 73,
    "barbecued_spareribs": 240,
    "barbecued_wing": 215,
    "beef_bourguignonne": 241,
    "beef_carpaccio": 114,
    "beef_stroganoff": 41,
    "beef_tartare": 18,
    "beef_wellington": 42,
    "beet_salad": 82,
    "beignet": 1,
    "bibimbap": 27,
    "biryani": 177,
    "blancmange": 149,
    "boiled_egg": 124,
    "boston_cream_pie": 225,
    "bread_pudding": 169,
    "brisket": 126,
    "bruschetta": 150,
    "bubble_and_squeak": 58,
    "buffalo_wing": 249,
    "burrito": 198,
    "caesar_salad": 94,
    "cannelloni": 182,
    "cannoli": 19,
    "caprese_salad": 60,
    "carbonnade_flamande": 231,
    "carrot_cake": 52,
    "casserole": 147,
    "ceviche": 141,
    "cheesecake": 188,
    "chicken_cordon_bleu": 246,
    "chicken_curry": 92,
    "chicken_kiev": 28,
    "chicken_marengo": 222,
    "chicken_provencale": 228,
    "chicken_quesadilla": 185,
    "chicken_wing": 93,
    "chiffon_cake": 219,
    "chili": 143,
    "chocolate_cake": 68,
    "chocolate_mousse": 172,
    "chop_suey": 32,
    "chow_mein": 16,
    "churro": 155,
    "clam_chowder": 110,
    "clam_food": 197,
    "club_sandwich": 51,
    "cockle_food": 3,
    "coconut_cake": 161,
    "coffee_cake": 119,
    "compote": 90,
    "confit": 175,
    "coq_au_vin": 77,
    "coquilles_saint_jacques": 212,
    "cottage_pie": 111,
    "couscous": 12,
    "crab_cake": 102,
    "crab_food": 117,
    "crayfish_food": 45,
    "creme_brulee": 62,
    "croque_madame": 112,
    "croquette": 11,
    "cruller": 2,
    "crumb_cake": 227,
    "crumpet": 107,
    "cupcake": 21,
    "custard": 120,
    "deviled_egg": 49,
    "dolmas": 211,
    "donut": 156,
    "dumpling": 8,
    "eccles_cake": 247,
    "edamame": 76,
    "egg_roll": 59,
    "eggs_benedict": 168,
    "enchilada": 140,
    "entrecote": 230,
    "escargot": 50,
    "falafel": 53,
    "farfalle": 54,
    "fettuccine": 142,
    "filet_mignon": 163,
    "fish_and_chips": 97,
    "fish_stick": 226,
    "flan": 144,
    "foie_gras": 20,
    "fondue": 64,
    "french_fries": 153,
    "french_onion_soup": 113,
    "french_toast": 139,
    "fried_calamari": 133,
    "fried_egg": 165,
    "fried_rice": 123,
    "frittata": 35,
    "fritter": 39,
    "frozen_yogurt": 136,
    "fruitcake": 31,
    "galantine": 125,
    "garlic_bread": 81,
    "gingerbread": 101,
    "gnocchi": 57,
    "greek_salad": 178,
    "grilled_cheese_sandwich": 201,
    "grilled_salmon": 152,
    "guacamole": 105,
    "gyoza": 130,
    "gyro": 202,
    "haggis": 33,
    "ham_and_eggs": 176,
    "ham_sandwich": 106,
    "hamburger": 164,
    "hot_and_sour_soup": 186,
    "hot_dog": 174,
    "huevos_rancheros": 179,
    "huitre": 218,
    "hummus": 96,
    "ice_cream": 193,
    "jambalaya": 66,
    "jerky": 131,
    "kabob": 145,
    "kedgeree": 80,
    "knish": 10,
    "lasagna": 98,
    "limpet_food": 189,
    "linguine": 75,
    "lobster_bisque": 200,
    "lobster_food": 91,
    "lobster_roll_sandwich": 205,
    "lobster_thermidor": 216,
    "lutefisk": 99,
    "macaron": 0,
    "macaroni_and_cheese": 79,
    "manicotti": 192,
    "marble_cake": 162,
    "matzo_ball": 245,
    "meat_loaf_food": 157,
    "meatball": 158,
    "miso_soup": 135,
    "moo_goo_gai_pan": 248,
    "mostaccioli": 243,
    "moussaka": 7,
    "mussel": 191,
    "nacho": 40,
    "omelette": 196,
    "onion_rings": 88,
    "orzo": 38,
    "osso_buco": 22,
    "oyster": 195,
    "pad_thai": 23,
    "paella": 148,
    "pancake": 86,
    "panna_cotta": 138,
    "pate": 85,
    "pavlova": 63,
    "peach_melba": 235,
    "peking_duck": 104,
    "penne": 167,
    "pepper_steak": 208,
    "pho": 204,
    "pilaf": 210,
    "pirogi": 234,
    "pizza": 183,
    "poached_egg": 56,
    "poi": 116,
    "pork_chop": 122,
    "porridge": 13,
    "potpie": 69,
    "pound_cake": 203,
    "poutine": 24,
    "prime_rib": 187,
    "profiterole": 220,
    "pulled_pork_sandwich": 26,
    "ramen": 25,
    "ravioli": 132,
    "red_velvet_cake": 89,
    "reuben": 127,
    "rigatoni": 17,
    "risotto": 30,
    "rissole": 242,
    "rock_cake": 239,
    "roulade": 199,
    "rugulah": 238,
    "salisbury_steak": 74,
    "samosa": 4,
    "sashimi": 9,
    "sauerbraten": 103,
    "sauerkraut": 61,
    "sausage_roll": 184,
    "savarin": 44,
    "scallop": 65,
    "scampi": 36,
    "schnitzel": 128,
    "scotch_egg": 233,
    "scrambled_eggs": 34,
    "scrapple": 159,
    "seaweed_salad": 15,
    "shirred_egg": 214,
    "shrimp_and_grits": 154,
    "sloppy_joe": 100,
    "souffle": 46,
    "spaghetti_bolognese": 70,
    "spaghetti_carbonara": 134,
    "sponge_cake": 146,
    "spring_roll": 43,
    "steak_au_poivre": 217,
    "steak_tartare": 83,
    "strawberry_shortcake": 109,
    "streusel": 48,
    "strudel": 160,
    "stuffed_cabbage": 14,
    "stuffed_peppers": 181,
    "stuffed_tomato": 250,
    "succotash": 95,
    "sukiyaki": 71,
    "sushi": 37,
    "syllabub": 121,
    "taco": 108,
    "tagliatelle": 180,
    "takoyaki": 170,
    "tamale": 78,
    "tamale_pie": 224,
    "tapenade": 207,
    "tempura": 67,
    "tenderloin": 171,
    "terrine": 55,
    "tetrazzini": 87,
    "tiramisu": 5,
    "toad_in_the_hole": 221,
    "torte": 115,
    "tortellini": 151,
    "tostada": 6,
    "tuna_tartare": 166,
    "upside_down_cake": 236,
    "veal_cordon_bleu": 213,
    "vermicelli": 84,
    "victoria_sandwich": 223,
    "vol_au_vent": 229,
    "waffle": 194,
    "welsh_rarebit": 209,
    "wonton": 137,
    "ziti": 190
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "qkv_bias": true,
  "transformers_version": "5.7.0"
}
